shercliff/baseCase/Fico_epotFoamBuoyant/PBiCGStab/weakScaling/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 1 0 0 );

boundaryField
{
  bottom
  {
    type            noSlip;
  }
  top
  {
    type            noSlip;
  }
  outlet
  {
    type            zeroGradient;
  }
  inlet
  {
    type            fixedValue;
    value           $internalField;
  }
  sides
  {
    type            noSlip;
  }
}


// ************************************************************************* //
